SAMS0N1TE/LakeShark/main/flipper_link.c
#include "flipper_link.h"

#include <ctype.h>
#include <strings.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/uart.h"
#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_rom_sys.h"
#include "soc/soc_caps.h"

#include "lakeshark_backend.h"
#include "audio_out.h"
#include "audio_eq.h"
#include "tone.h"

static const char *TAG = "fl_link";

#define FL_LINE_MAX    192
#define REPLY_MAX   256
#define TEL_MAX     576
#define RX_BUF_SZ   1024
#define TX_BUF_SZ   2048

static flipper_link_cfg_t s_cfg      = FLIPPER_LINK_CFG_DEFAULT();
static flipper_link_host_t s_host    = { 0 };
static TaskHandle_t       s_task     = NULL;
static volatile bool      s_run      = false;
static volatile bool      s_verbose  = false;
static volatile bool      s_installed = false;

static uint32_t s_rx_lines  = 0;
static uint32_t s_tx_lines  = 0;
static uint32_t s_bad_lines = 0;

static volatile bool s_stat_now = false;

static esp_err_t link_install(void);
static void      link_uninstall(void);

typedef enum { HOST_MODE_P25, HOST_MODE_ADSB, HOST_MODE_FM } host_mode_t;

static host_mode_t host_mode(void)
{
    const char *n = s_host.current_mode_name ? s_host.current_mode_name() : "P25";
    if (!n) return HOST_MODE_P25;
    if (!strcasecmp(n, "FM"))    return HOST_MODE_FM;
    if (!strcasecmp(n, "ADS-B")) return HOST_MODE_ADSB;
    if (!strcasecmp(n, "ADSB"))  return HOST_MODE_ADSB;
    return HOST_MODE_P25;
}

static void str_upper(char *s)
{
    for (; *s; s++) *s = (char)toupper((unsigned char)*s);
}

static int tokenize(char *line, char **argv, int max)
{
    int argc = 0;
    char *p = line;
    while (*p && argc < max) {
        while (*p == ' ' || *p == '\t') p++;
        if (!*p) break;
        argv[argc++] = p;
        while (*p && *p != ' ' && *p != '\t') p++;
        if (*p) *p++ = '\0';
    }
    return argc;
}

static void sanitize(char *s)
{
    for (; *s; s++) {
        if (*s == ' ' || *s == '\t' || *s == '=' || *s == '\r' || *s == '\n') *s = '_';
    }
}

static bool parse_i32(const char *s, int32_t *out)
{
    if (!s || !*s) return false;
    char *end = NULL;
    long v = strtol(s, &end, 0);
    if (end == s) return false;
    while (*end == ' ') end++;
    if (*end) return false;
    *out = (int32_t)v;
    return true;
}

static bool parse_freq_hz(const char *s, uint32_t *out)
{
    if (!s || !*s) return false;
    char *end = NULL;
    double v = strtod(s, &end);
    if (end == s || v <= 0) return false;
    if (v < 10000.0) v *= 1e6;
    if (v < 1e6 || v > 2.0e9) return false;
    *out = (uint32_t)(v + 0.5);
    return true;
}

static uint32_t s_last_bps = 0;
static int64_t  s_bps_ok_us = 0;

static bool s_bps_seen = false;

static int sdr_stall_s(void)
{
    int64_t now = esp_timer_get_time();

    if (!lakeshark_radio_device_ready()) {

        s_bps_ok_us = now;
        return 0;
    }
    if (s_last_bps > 0) {
        s_bps_ok_us = now;
        s_bps_seen  = true;
        return 0;
    }
    if (!s_bps_seen || s_bps_ok_us == 0) {
        s_bps_ok_us = now;
        return 0;
    }
    return (int)((now - s_bps_ok_us) / 1000000LL);
}

static void sdr_stall_reset(void)
{
    s_bps_seen  = false;
    s_last_bps  = 0;
    s_bps_ok_us = esp_timer_get_time();
}

static int append_sys(char *buf, size_t len, int n)
{
    static int64_t last_us = 0;

    if (n < 0 || (size_t)n >= len - 1) return n;

    int stall = sdr_stall_s();

    int64_t now = esp_timer_get_time();

    bool due = !last_us || (now - last_us >= 1000000LL);
    if (!due && stall == 0) return n;
    if (due) last_us = now;

    uint32_t up = s_host.uptime_s ? s_host.uptime_s() : 0;
    uint32_t fi = 0, fd = 0, fp = 0;
    if (s_host.heap_stats) s_host.heap_stats(&fi, &fd, &fp);

    int w = snprintf(buf + n, len - (size_t)n, " up=%lu fi=%lu fd=%lu stl=%d",
                     (unsigned long)up, (unsigned long)fi, (unsigned long)fd, stall);
    if (w < 0 || (size_t)(n + w) >= len - 1) return n;
    return n + w;
}

int flipper_link_eq_snapshot(char *buf, size_t len)
{
    if (!buf || len < 8) return 0;

    audio_eq_cfg_t eq;
    audio_eq_get(&eq);

    int n = snprintf(buf, len, "& eq=%d eh=%d eb=%d et=%d ep=%d el=%d egr=%d\n",
                     eq.preset, eq.hp10 * 10, eq.bass_db, eq.treb_db,
                     eq.punch, eq.loud, audio_eq_gr_db10());
    if (n < 0) return 0;
    if ((size_t)n >= len) n = (int)len - 1;
    return n;
}

static int build_telemetry_fm(char *buf, size_t len)
{
    static const char *sub[] = { "listen", "scan", "pocsag", "wfm" };

    lakeshark_fm_tel_t t;
    lakeshark_fm_telemetry(&t);
    s_last_bps = t.iq_bytes_sec;

    char text[80];
    strlcpy(text, t.pocsag_last_text[0] ? t.pocsag_last_text : "-", sizeof(text));
    sanitize(text);

    char ptype[2] = { t.pocsag_last_type ? t.pocsag_last_type : '-', 0 };

    return snprintf(buf, len,
        "$ f=%lu g=%d v=%d mu=%d iq=%d rtl=%d re=%d bps=%lu md=FM "
        "fm=%s sq=%d so=%d au=%d "
        "ss=%lu se=%lu spk=%lu sdb=%d sw=%lu "
        "pb=%d pau=%d psy=%d pp=%lu pf=%lu pa=%lu pbd=%d pty=%s ptx=%s",
        (unsigned long)t.freq_hz, t.gain_tenths,
        audio_volume_get(), audio_is_muted() ? 1 : 0,
        t.iq_level, lakeshark_radio_device_ready() ? 1 : 0, t.read_errors,
        (unsigned long)t.iq_bytes_sec,
        sub[t.submode & 3], t.squelch_tenths, t.squelch_open, t.audio_level,
        (unsigned long)t.scan_start_hz, (unsigned long)t.scan_stop_hz,
        (unsigned long)t.scan_peak_hz, t.scan_peak_db,
        (unsigned long)t.scan_sweeps,
        t.pocsag_baud, t.pocsag_auto, t.pocsag_sync,
        (unsigned long)t.pocsag_pages, (unsigned long)t.pocsag_frames,
        (unsigned long)t.pocsag_last_addr, t.pocsag_last_baud, ptype, text);
}

#define AC_PER_FRAME 4

static int build_telemetry_adsb(char *buf, size_t len)
{
    static int s_ac_cursor = 0;

    lakeshark_adsb_tel_t t;
    lakeshark_adsb_telemetry(&t);
    s_last_bps = t.iq_bytes_sec;

    if (t.n_aircraft <= 0) s_ac_cursor = 0;
    else if (s_ac_cursor >= t.n_aircraft) s_ac_cursor = 0;

    int n = snprintf(buf, len,
        "$ f=%lu g=%d v=%d mu=%d rtl=%d bps=%lu md=ADSB "
        "ac=%d mt=%d mps=%d cg=%d ce=%d bps1=%d mga=%d mgp=%d lms=%d "
        "aci=%d acn=%d",
        (unsigned long)t.freq_hz, t.gain_tenths,
        audio_volume_get(), audio_is_muted() ? 1 : 0,
        t.rtl_ready, (unsigned long)t.iq_bytes_sec,
        t.tracked, t.msgs_total, t.msgs_sec, t.crc_good, t.crc_err,
        t.bursts_sec, t.mag_avg, t.mag_peak, t.last_msg_ms,
        s_ac_cursor, t.n_aircraft);
    if (n < 0) return n;

    for (int k = 0; k < AC_PER_FRAME && (size_t)n < len - 1; k++) {
        int idx = s_ac_cursor + k;
        if (idx >= t.n_aircraft) break;

        lakeshark_adsb_ac_t a;
        if (!lakeshark_adsb_aircraft_at(idx, &a)) break;

        char call[12];
        strlcpy(call, a.callsign[0] ? a.callsign : "-", sizeof(call));
        sanitize(call);

        int w = snprintf(buf + n, len - (size_t)n,
                         " a%d=%06lX,%s,%d,%d,%d,%d,%d,%d",
                         idx, (unsigned long)a.icao, call,
                         a.altitude, a.velocity, a.heading, a.vert_rate,
                         a.age_ms, a.msg_count);
        if (w < 0 || (size_t)(n + w) >= len - 1) break;
        n += w;
    }

