SAMS0N1TE/LakeShark/main/flipper_link.c
    s_ac_cursor += AC_PER_FRAME;
    if (s_ac_cursor >= t.n_aircraft) s_ac_cursor = 0;

    return n;
}

static int build_telemetry_p25(char *buf, size_t len)
{

    lakeshark_p25_tel_t t;
    lakeshark_p25_telemetry(&t);
    s_last_bps = t.iq_bytes_sec;

    char ftype[16];
    char err[64];
    strlcpy(ftype, t.ftype[0] ? t.ftype : "-", sizeof(ftype));
    strlcpy(err,   t.err[0]   ? t.err   : "-", sizeof(err));
    sanitize(ftype);
    sanitize(err);

    const char *mode = (s_host.current_mode_name ? s_host.current_mode_name() : "P25");

    return snprintf(buf, len,
        "$ f=%lu dm=%d dmn=%s g=%d agc=%d v=%d mu=%d "
        "nac=%d tg=%d src=%d na=%d ta=%d sa=%d sy=%d vo=%d sc=%d vc=%d bo=%d bf=%d "
        "iq=%d pol=%d bp=%d vg=%d rtl=%d rf=%d rs=%d re=%d "
        "bps=%lu ad=%lu dus=%d md=%s ft=%s e=%s",
        (unsigned long)t.freq_hz, t.demod_mode, lakeshark_p25_mode_name(),
        t.gain_tenths, t.agc_on, audio_volume_get(), audio_is_muted() ? 1 : 0,
        t.nac, t.tg, t.src,
        t.nac_age_ms, t.tg_age_ms, t.src_age_ms,
        t.has_sync, t.voice_active,
        t.sync_count, t.voice_count, t.bch_ok, t.bch_fail,
        t.iq_level, t.polarity_inverted, t.beep, t.voice_gate, t.rtl_ready,
        t.ring_fill, t.ring_size, t.read_errors,
        (unsigned long)t.iq_bytes_sec, (unsigned long)t.audio_drops, t.decode_us,
        mode, ftype, err);
}

static int build_telemetry(char *buf, size_t len)
{
    int n;
    switch (host_mode()) {
    case HOST_MODE_FM:   n = build_telemetry_fm(buf, len);   break;
    case HOST_MODE_ADSB: n = build_telemetry_adsb(buf, len); break;
    default:             n = build_telemetry_p25(buf, len);  break;
    }
    if (n < 0) return n;

    if ((size_t)n >= len - 2) n = (int)len - 2;

    n = append_sys(buf, len, n);

    buf[n++] = '\n';
    buf[n]   = '\0';
    return n;
}

static void eq_reply(char *reply, size_t reply_len)
{
    audio_eq_cfg_t eq;
    audio_eq_get(&eq);
    snprintf(reply, reply_len,
             "+OK eq=%s hp=%d bass=%+d treb=%+d punch=%d loud=%d\n",
             audio_eq_preset_name(eq.preset), eq.hp10 * 10,
             eq.bass_db, eq.treb_db, eq.punch, eq.loud);
}

static void handle_line(char *line, char *reply, size_t reply_len)
{
    reply[0] = '\0';

    char *argv[8];
    int argc = tokenize(line, argv, 8);
    if (argc == 0) return;

    str_upper(argv[0]);
    const char *cmd = argv[0];
    const char *a1  = (argc > 1) ? argv[1] : NULL;
    int32_t     n   = 0;

    if (!strcmp(cmd, "PING")) {
        snprintf(reply, reply_len, "+PONG %d LakeShark\n", FLIPPER_LINK_PROTO_VERSION);

    } else if (!strcmp(cmd, "STAT")) {
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK\n");

    } else if (!strcmp(cmd, "FREQ")) {
        uint32_t hz;
        if (!a1 || !parse_freq_hz(a1, &hz)) {
            snprintf(reply, reply_len, "-ERR freq\n");
        } else if (host_mode() == HOST_MODE_ADSB) {
            snprintf(reply, reply_len, "-ERR adsb is fixed at 1090 MHz\n");
        } else {

            if (host_mode() == HOST_MODE_FM) lakeshark_fm_set_freq(hz);
            else                             lakeshark_p25_set_freq(hz);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK f=%lu\n", (unsigned long)hz);
        }

    } else if (!strcmp(cmd, "TUNE")) {
        if (!a1 || !parse_i32(a1, &n)) {
            snprintf(reply, reply_len, "-ERR tune\n");
        } else if (host_mode() == HOST_MODE_ADSB) {
            snprintf(reply, reply_len, "-ERR adsb is fixed at 1090 MHz\n");
        } else {
            uint32_t now;
            if (host_mode() == HOST_MODE_FM) {
                lakeshark_fm_tune((int)n);
                now = lakeshark_fm_get_freq();
            } else {
                lakeshark_p25_tune((int)n);
                now = lakeshark_p25_get_freq();
            }
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK f=%lu\n", (unsigned long)now);
        }

    } else if (!strcmp(cmd, "FM")) {

        static const char *names[] = { "listen", "scan", "pocsag", "wfm" };
        if (!a1) {
            snprintf(reply, reply_len, "+OK fm=%s\n", names[lakeshark_fm_get_mode() & 3]);
            return;
        }
        char up[16];
        strlcpy(up, a1, sizeof(up));
        for (char *p = up; *p; p++) *p = (char)tolower((unsigned char)*p);

        int m = -1;
        for (int i = 0; i < 4; i++) if (!strcmp(up, names[i])) { m = i; break; }
        if (m < 0 && !strcmp(up, "nbfm")) m = 0;
        if (m < 0 && parse_i32(a1, &n) && n >= 0 && n <= 3) m = (int)n;
        if (m < 0) { snprintf(reply, reply_len, "-ERR fm\n"); return; }

        if (host_mode() != HOST_MODE_FM && s_host.select_mode_by_name) {
            sdr_stall_reset();
            s_host.select_mode_by_name("fm");
        }
        lakeshark_fm_set_mode(m);
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK fm=%s\n", names[m]);

    } else if (!strcmp(cmd, "SQL")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else if (a1[0] == '+' || a1[0] == '-') {
            if (!parse_i32(a1, &n)) { snprintf(reply, reply_len, "-ERR sql\n"); return; }
            lakeshark_fm_squelch_delta((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else if (parse_i32(a1, &n)) {
            lakeshark_fm_set_squelch((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else {
            snprintf(reply, reply_len, "-ERR sql\n");
        }

    } else if (!strcmp(cmd, "BAUD")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK pb=%d\n", lakeshark_fm_get_baud());
        } else if (parse_i32(a1, &n)) {
            lakeshark_fm_set_baud((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK pb=%d\n", lakeshark_fm_get_baud());
        } else {
            snprintf(reply, reply_len, "-ERR baud\n");
        }

    } else if (!strcmp(cmd, "SCAN")) {
        lakeshark_fm_scan_restart();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK\n");

    } else if (!strcmp(cmd, "PEAK")) {
        lakeshark_fm_tune_to_peak();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK f=%lu\n",
                 (unsigned long)lakeshark_fm_get_freq());

