SAMS0N1TE/LakeShark/main/flipper_link.c
        if (a1 && !strcasecmp(a1, "reset")) {
            if (!s_host.c6_reset) { snprintf(reply, reply_len, "-ERR no c6 hook\n"); return; }
            snprintf(reply, reply_len, "+OK c6 reset\n");
            s_host.c6_reset();
        } else if (a1 && !strcasecmp(a1, "up")) {
            if (!s_host.c6_up) { snprintf(reply, reply_len, "-ERR no c6 hook\n"); return; }
            int e = s_host.c6_up();
            snprintf(reply, reply_len, "+OK c6 up=%d\n", e);
        } else {
            snprintf(reply, reply_len, "-ERR c6 <reset|up>\n");
        }

    } else if (!strcmp(cmd, "SDR")) {
        if (a1 && !strcasecmp(a1, "reset")) {

            if (!s_host.sdr_reset) { snprintf(reply, reply_len, "-ERR no sdr hook\n"); return; }
            s_host.sdr_reset();
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sdr reset rtl=%d\n",
                     lakeshark_radio_device_ready() ? 1 : 0);
        } else if (a1 && !strcasecmp(a1, "recover")) {

            if (!s_host.sdr_recover) {
                snprintf(reply, reply_len, "-ERR no sdr recover hook\n");
                return;
            }
            s_host.sdr_recover();
            snprintf(reply, reply_len, "+OK sdr recovering\n");

        } else if (a1 && !strcasecmp(a1, "power")) {

            if (!s_host.sdr_power_cycle) {
                snprintf(reply, reply_len, "-ERR no sdr power hook\n");
                return;
            }
            snprintf(reply, reply_len, "+OK sdr power cycling\n");
            s_host.sdr_power_cycle();
        } else {
            snprintf(reply, reply_len, "+OK rtl=%d stl=%d\n",
                     lakeshark_radio_device_ready() ? 1 : 0, sdr_stall_s());
        }

    } else if (!strcmp(cmd, "BLE")) {

        if (!s_host.ble_enable) {
            snprintf(reply, reply_len, "-ERR no ble hook\n");
            return;
        }
        if (a1 && !strcasecmp(a1, "off")) {
            s_host.ble_enable(false);
            snprintf(reply, reply_len, "+OK ble off\n");
        } else if (a1 && !strcasecmp(a1, "on")) {
            s_host.ble_enable(true);
            snprintf(reply, reply_len, "+OK ble on\n");
        } else {
            snprintf(reply, reply_len, "-ERR ble <on|off>\n");
        }

    } else if (!strcmp(cmd, "TEL")) {
        if (!a1 || !parse_i32(a1, &n)) {
            snprintf(reply, reply_len, "+OK tel=%d\n", s_cfg.telemetry_hz);
        } else {
            if (n < 0)  n = 0;
            if (n > 20) n = 20;
            s_cfg.telemetry_hz = (int)n;
            snprintf(reply, reply_len, "+OK tel=%d\n", s_cfg.telemetry_hz);
        }

    } else if (!strcmp(cmd, "EQ")) {
        audio_eq_cfg_t eq;
        audio_eq_get(&eq);

        if (!a1) {
            eq_reply(reply, reply_len);
            return;
        }

        char up[16];
        strlcpy(up, a1, sizeof(up));
        str_upper(up);

        const char *a2 = (argc > 2) ? argv[2] : NULL;
        bool is_field = strcmp(up, "BASS") == 0 || strcmp(up, "TREB") == 0 ||
                        strcmp(up, "HP")   == 0 || strcmp(up, "PUNCH") == 0 ||
                        strcmp(up, "LOUD") == 0;
        bool need_val = is_field && a2 != NULL;

        if (!need_val) {
            int p = audio_eq_preset_from_name(a1);
            if (p < 0 && parse_i32(a1, &n) &&
                n >= 0 && n < AUDIO_EQ_PRESET_COUNT) p = (int)n;
            if (p < 0) { snprintf(reply, reply_len, "-ERR eq\n"); return; }
            audio_eq_apply_preset(p);
            s_stat_now = true;
            eq_reply(reply, reply_len);
            return;
        }

        if (!a2 || !parse_i32(a2, &n)) { snprintf(reply, reply_len, "-ERR eq\n"); return; }

        if (!strcmp(up, "HP")) {
            int hz = (n > 0 && n < AUDIO_EQ_HP_MIN) ? (int)n * 10 : (int)n;
            eq.hp10 = (uint8_t)(hz <= 0 ? 0 : (hz + 5) / 10);
        } else if (!strcmp(up, "BASS")) {
            eq.bass_db = (int8_t)n;
        } else if (!strcmp(up, "TREB")) {
            eq.treb_db = (int8_t)n;
        } else if (!strcmp(up, "PUNCH")) {
            eq.punch = (uint8_t)(n < 0 ? 0 : (n > 100 ? 100 : n));
        } else {
            eq.loud = (uint8_t)(n < 0 ? 0 : (n > AUDIO_EQ_LOUD_MAX ? AUDIO_EQ_LOUD_MAX : n));
        }
        eq.preset = AUDIO_EQ_CUSTOM;
        audio_eq_set(&eq);
        s_stat_now = true;
        eq_reply(reply, reply_len);

    } else if (!strcmp(cmd, "TEST")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK test=%s busy=%d\n",
                     "sweep|bass|noise|tone|chirp|moto", snd_test_busy() ? 1 : 0);
            return;
        }
        int w = snd_test_from_name(a1);
        if (w < 0 && parse_i32(a1, &n) && n >= 0 && n < SND_TEST_COUNT) w = (int)n;
        if (w < 0) { snprintf(reply, reply_len, "-ERR test\n"); return; }

        audio_out_ensure_unmuted();
        if (!snd_test_start(w)) {
            snprintf(reply, reply_len, "-ERR test busy\n");
            return;
        }
        snprintf(reply, reply_len, "+OK test=%s\n", snd_test_name(w));

    } else {
        s_bad_lines++;
        snprintf(reply, reply_len, "-ERR unknown %s\n", cmd);
    }
}

int flipper_link_snapshot(char *buf, size_t len)
{
    return build_telemetry(buf, len);
}

static const int SCAN_PINS[] = {
    33, 32, 45, 47, 48, 0, 1, 2, 3, 6, 4, 5, 20, 21, 22, 23, 36,
};
#define N_SCAN_PINS ((int)(sizeof(SCAN_PINS) / sizeof(SCAN_PINS[0])))

#define VBUS_EN_GPIO 46
#define C6_EN_GPIO   54

static const int IDLE_HIGH_PINS[] = { 32, 36 };

static bool pin_idles_high(int pin)
{
    for (size_t i = 0; i < sizeof(IDLE_HIGH_PINS) / sizeof(IDLE_HIGH_PINS[0]); i++) {
        if (IDLE_HIGH_PINS[i] == pin) return true;
    }
    return false;
}

int flipper_link_scan_rx(int dwell_ms)
{
    if (dwell_ms < 200)  dwell_ms = 200;
    if (dwell_ms > 5000) dwell_ms = 5000;

    flipper_link_cfg_t saved = s_cfg;
    bool was_running = s_run;
    if (was_running) flipper_link_stop();

    s_cfg.tx_gpio = -1;
    esp_err_t err = link_install();
    if (err != ESP_OK) {
        printf("scan: uart install failed: %s\n", esp_err_to_name(err));
        s_cfg = saved;
        if (was_running) flipper_link_start(&s_cfg, NULL);
        return -1;
    }

    printf("scanning %d pins, %d ms each (drive the head so it keeps talking)\n",
           N_SCAN_PINS, dwell_ms);

    int best = -1;
    size_t best_n = 0;
    for (int i = 0; i < N_SCAN_PINS; i++) {
        int pin = SCAN_PINS[i];

