SAMS0N1TE/LakeShark/main/flipper_link.c
        if (uart_set_pin(s_cfg.uart_num, UART_PIN_NO_CHANGE, pin,
                         UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE) != ESP_OK) {
            printf("  GPIO%-2d : (cannot route)\n", pin);
            continue;
        }
        uart_flush_input(s_cfg.uart_num);
        vTaskDelay(pdMS_TO_TICKS(dwell_ms));

        size_t avail = 0;
        uart_get_buffered_data_len(s_cfg.uart_num, &avail);

        char peek[33] = { 0 };
        if (avail) {
            int n = uart_read_bytes(s_cfg.uart_num, (uint8_t *)peek,
                                    avail > 32 ? 32 : avail, 0);
            for (int k = 0; k < n; k++) {
                if (peek[k] < 32 || peek[k] > 126) peek[k] = '.';
            }
            peek[n > 0 ? n : 0] = '\0';
        }
        printf("  GPIO%-2d : %4u bytes  %s\n", pin, (unsigned)avail, peek);

        if (avail > best_n) { best_n = avail; best = pin; }
        uart_flush_input(s_cfg.uart_num);
    }

    link_uninstall();
    s_cfg = saved;
    if (was_running) flipper_link_start(&s_cfg, NULL);

    if (best >= 0) printf("scan: busiest pin GPIO%d (%u bytes)\n", best, (unsigned)best_n);
    else           printf("scan: nothing heard on any pin\n");
    return best;
}

static int probe_pin_pct(int pin)
{
    gpio_config_t in = {
        .pin_bit_mask = 1ULL << pin,
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_ENABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    if (gpio_config(&in) != ESP_OK) return -1;

    vTaskDelay(pdMS_TO_TICKS(5));

    int high = 0;
    const int samples = 200;
    for (int i = 0; i < samples; i++) {
        if (gpio_get_level(pin)) high++;
        esp_rom_delay_us(100);
    }

    in.pull_down_en = GPIO_PULLDOWN_DISABLE;
    gpio_config(&in);

    return (high * 100) / samples;
}

int flipper_link_probe_rx(void)
{
    flipper_link_cfg_t saved = s_cfg;
    bool was_running = s_run;
    if (was_running) flipper_link_stop();

    esp_log_level_t gpio_lvl = esp_log_level_get("gpio");
    esp_log_level_set("gpio", ESP_LOG_WARN);

    printf("probing %d header pins with a pull-down.\n"
           "  ~100%% = something external is driving it high (an idle UART TX)\n"
           "  <100%% = that line is also carrying traffic\n"
           "     0%% = nothing connected, or the far end is unpowered\n",
           N_SCAN_PINS);

    int best = -1, best_pct = 0, found = 0;
    for (int i = 0; i < N_SCAN_PINS; i++) {
        int pin = SCAN_PINS[i];
        if (pin == VBUS_EN_GPIO || pin == C6_EN_GPIO) continue;

        int pct = probe_pin_pct(pin);
        if (pct < 0) {
            printf("  GPIO%-2d : (cannot configure)\n", pin);
            continue;
        }

        bool baseline = pin_idles_high(pin);
        printf("  GPIO%-2d : %3d%% high%s\n", pin, pct,
               baseline ? "   (board pull-up, ignored)"
                        : (pct > 0 ? "   <-- driven" : ""));
        if (baseline) continue;

        if (pct > 0) found++;
        if (pct > best_pct) { best_pct = pct; best = pin; }
    }

    if (best >= 0) {
        printf("probe: GPIO%d is being driven (%d%%). %d pin(s) driven in total.\n",
               best, best_pct, found);
        if (best != saved.rx_gpio) {
            printf("probe: the link expects RX on GPIO%d - the wire is on the "
                   "wrong pin. `link pins %d %d` to adopt it.\n",
                   saved.rx_gpio, best, saved.tx_gpio);
        } else {
            printf("probe: that is the configured RX pin - wiring is good.\n");
        }
    } else {
        printf("probe: every pin followed the pull-down - the head's TX is not "
               "reaching any P4 header pin.\n"
               "       The P4 cannot see C6_IO12/C6_IO13/C6_U0RXD/C6_U0TXD at "
               "all (those belong to the on-board ESP32-C6), so a jumper one or\n"
               "       two positions off the mark looks exactly like this. "
               "Count header positions against the Waveshare pinout, and check "
               "the head is powered with its app open.\n");
    }

    esp_log_level_set("gpio", gpio_lvl);
    s_cfg = saved;
    if (was_running) flipper_link_start(&s_cfg, NULL);
    return best;
}

void flipper_link_inject(const char *line, char *reply, size_t reply_len)
{
    char tmp[FL_LINE_MAX];
    strlcpy(tmp, line, sizeof(tmp));
    handle_line(tmp, reply, reply_len);
}

static void link_write(const char *s, int len)
{
    if (!s_installed) return;
    uart_write_bytes(s_cfg.uart_num, s, len);
    s_tx_lines++;
}

static void link_task(void *arg)
{
    (void)arg;
    char    line[FL_LINE_MAX];
    int     pos = 0;
    char    reply[REPLY_MAX];
    char    tel[TEL_MAX];
    uint8_t rx[128];
    int64_t next_tel_us = 0;

    ESP_LOGI(TAG, "link task up: uart%d rx=GPIO%d tx=GPIO%d %lu baud tel=%dHz",
             s_cfg.uart_num, s_cfg.rx_gpio, s_cfg.tx_gpio,
             (unsigned long)s_cfg.baud, s_cfg.telemetry_hz);

    while (s_run) {
        int n = uart_read_bytes(s_cfg.uart_num, rx, sizeof(rx), pdMS_TO_TICKS(20));
        for (int i = 0; i < n; i++) {
            char c = (char)rx[i];
            if (c == '\n' || c == '\r') {
                if (pos > 0) {
                    line[pos] = '\0';
                    s_rx_lines++;
                    if (s_verbose) ESP_LOGI(TAG, "RX <%s>", line);
                    handle_line(line, reply, sizeof(reply));
                    if (reply[0]) link_write(reply, (int)strlen(reply));
                    pos = 0;
                }
            } else if (pos < FL_LINE_MAX - 1) {
                line[pos++] = c;
            } else {

                pos = 0;
                s_bad_lines++;
            }
        }

        int64_t now = esp_timer_get_time();
        int hz = s_cfg.telemetry_hz;
        bool due = s_stat_now || (hz > 0 && now >= next_tel_us);
        if (due) {
            s_stat_now = false;
            if (hz > 0) next_tel_us = now + (1000000 / hz);
            int len = build_telemetry(tel, sizeof(tel));
            if (len > 0) link_write(tel, len > (int)sizeof(tel) - 1
                                             ? (int)sizeof(tel) - 1 : len);
            char eqline[96];
            int eqn = flipper_link_eq_snapshot(eqline, sizeof(eqline));
            if (eqn > 0) link_write(eqline, eqn);
        }
    }

    ESP_LOGI(TAG, "link task exiting");
    s_task = NULL;
    vTaskDelete(NULL);
}

static esp_err_t link_install(void)
{
    uart_config_t uc = {
        .baud_rate  = (int)s_cfg.baud,
        .data_bits  = UART_DATA_8_BITS,
        .parity     = UART_PARITY_DISABLE,
        .stop_bits  = UART_STOP_BITS_1,
        .flow_ctrl  = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };

